Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector Methods
The ModelObjectSelector type exposes the following members.
Methods
Name | Description
GetObjectsByBoundingBox
 Returns an enumerator of the given view's visible model objects that collide with the given geometrical bounding box. Note that this method uses approximate bounding boxes and thus is NOT EXACT, and may return objects not necessarily colliding with the given box but only being somewhere near to it.
GetSelectedObjects
 Returns an enumerator of all the selected model objects in the model view.
Select(ArrayList)
 Selects a list of objects from the user interface.
Select(ArrayList, Boolean)
 Selects a list of objects from the user interface.
Top
See Also
Reference
ModelObjectSelector Class
Tekla.Structures.Model.UI Namespace